//Циклы while и for
// Решите эти задачи сначала через цикл while, а затем через цикл for
// Task 1. Выведите столбец чисел от 1 до 100.
// let i = 0;
// while (i < 100) {
//   i++;
//   console.log(i);
// };

// for (; i <= 100; i++) {
//   console.log(i);
// }

//Task 2. Выведите столбец чисел от 11 до 33.
// let i = 11;

// while (i <= 33) {
//   console.log(i);
//   i++;
// };

// for ( ; i <= 33; i++) {
//   console.log(i);
// };

//Task 3. Выведите столбец четных чисел в промежутке от 0 до 100
// let i = 0;

// while (i < 100) {
//   i = i + 2;
//   console.log(i);
// };

// for( ; i <= 100; i += 2) {
//   console.log(i);
// };

//Task 4.С помощью цикла найдите сумму чисел от 1 до 100
// let i = 0;
// let sum = 0;

// while (i < 100) {
//   i++;
//   sum += i;
// };
// console.log(sum);

// for ( ; i <= 100; i++) {
//   sum += i;
// };
// console.log(sum);

//Task 5. Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет
// меньше 50. Какое число получится? Посчитайте количество итераций, необходимых
// для этого (итерация - это проход цикла), и запишите его в переменную num.

// let n = 1000;
// while (n > 50) {
//   n /= 2;
//   console.log(n)
// };

// for (; n > 50; ) {
//   n /= 2;
//   console.log(n);
// };
